// אני אסביר בעברית כי יהיה לי קשה להסביר באנגלית
// בעצם יש בעיה של מה קורה אם השפה בה נכתוב תהיה עברית, כלומר מימין לשמאל ולא שמאל לימין
// אז נצטרך לוודא מה השפה בה אנחנו כותבים
// פה היה לי טיפה בלאגן ואחרי חיפוש בגוגל מצאתי סוג של ביטוי רגולרי לשפות
// זה נשמע מוזר אבל בעצם כל השפות שנכתבות מימין לשמאל כמו עברית וערבית מכוסים בטווח מסוים
// בנושם יש מספר טווחים כאלה למספר שפות על ערבית וכאלה. בשביל לא להסתבך בחרתי בכולם
// נשמע מוזר אבל פשוט במקום לבדוק מה ספציפי של עברית ומה של אנגלית שהם השפות הרלוונטיות
// ביטלתי (במירכאות) את השפות שנכתבות מימין לשמאל
// בעצם נבדוק אם הטקסט שלנו מוגדר נבצע חיתוך על הטקסט ונחפש אם הוא שפה 
// RTL - Right To Left
// שימוש בפונקציה טסט בודקת את השפה לפי התו הראשון

export const isRTL = (text) => {
    if (!text || typeof text !== 'string') return false; // אם הטקסט אינו מחרוזת
  
    const firstChar = text.trim().charAt(0);
    
    // ה"טווחים" של השפות מימין לשמאל (לפי גוגל)
    const rtlRanges = [
      '\u0591-\u07FF',
      '\uFB1D-\uFDFD',
      '\uFE70-\uFEFC',
    ];
  
    const rtlRegularExresion = new RegExp(`[${rtlRanges.join('')}]`);
  
    return rtlRegularExresion.test(firstChar);
  };
  